[
  {
    "business_name": "Chimis Fresh Mex",
    "category": "Mexican",
    "city": "FLorissant, MO",
    "price_range": "$$",
    "overall_rating": "3.9",
    "total_reviews": "119",
    "reviewer_name": "Kate Y.",
    "review_date": "Dec 7, 2024",
    "review_text": "This place is amazing. The vibes inside are really cool and the murals are beautiful. Happy waiters and servers and the food was delicious. The chorizo dip is so flavorful and the steak fajita chimi was to die for. Such tender and flavorful steak. Definitely recommend",
    "star_rating": "5 star rating"
  },
  {
    "business_name": "Chimis Fresh Mex",
    "category": "Mexican",
    "city": "FLorissant, MO",
    "price_range": "$$",
    "overall_rating": "3.9",
    "total_reviews": "119",
    "reviewer_name": "Arada H.",
    "review_date": "Nov 10, 2024",
    "review_text": "Went on Saturday around 1:30 pm with my teens home from college. We were seated promptly. There was a good number of tables occupied in the large dining room. When our server brought our drinks we ordered Guacamole dip, to eat with the complementary chips & salsa. That was a small portion for the price. Then we ordered our entrees: Fish tacos, Shrimp cocktail, Mixed Fajitas, Sopa de Pollo. 1 of the 3 fish tacos has only 1 small strip of fish, compared with the other 2 tacos that were more filled, so consistency was not achieved. For the Fajitas we asked for extra rice instead of sour cream & beans. No big issues with any of the orders.This chain does not have a location near our home (this one was 30 min away) so we won't likely be back unless we're in the area for another reason.",
    "star_rating": "4 star rating"
  },
  {
    "business_name": "Chimis Fresh Mex",
    "category": "Mexican",
    "city": "FLorissant, MO",
    "price_range": "$$",
    "overall_rating": "3.9",
    "total_reviews": "119",
    "reviewer_name": "Erica D.",
    "review_date": "Oct 10, 2024",
    "review_text": "Chimis is a local neighborhood treasure that I probably frequent at least once a month. I know majority of the front of house staff because they've been there since o started going which is great!The chips and salsa are always fresh and I've never been disappointed in a margarita.If you are hesitant to give it a try, don't be. They have an amazing deal in Groupon for a sis punted experience m. You WILL NOT be disappointed.",
    "star_rating": "5 star rating"
  },
  {
    "business_name": "Chimis Fresh Mex",
    "category": "Mexican",
    "city": "FLorissant, MO",
    "price_range": "$$",
    "overall_rating": "3.9",
    "total_reviews": "119",
    "reviewer_name": "Desiree R.",
    "review_date": "Oct 12, 2022",
    "review_text": "Love this place fast service fast foodBig enough to accommodate large parties and celebrations! They are very accommodating the burrito cake out very hot so I knew it was fresh as you see in the photo I got a margarita that's half gone definitely nice won't be disappointed they also have coke products and rice water, horchata, limonada etc.... I can't speak more highly of this place",
    "star_rating": "5 star rating"
  },
  {
    "business_name": "Chimis Fresh Mex",
    "category": "Mexican",
    "city": "FLorissant, MO",
    "price_range": "$$",
    "overall_rating": "3.9",
    "total_reviews": "119",
    "reviewer_name": "Desiree R.",
    "review_date": "Jul 5, 2025",
    "review_text": "Love them this entire place Mario and the whole staff.Drinks & food are always on point I hope they open back up before the new year (flooded out)",
    "star_rating": "5 star rating"
  }
]